# split the string into multi columns

In [1]:
import pandas as pd

Make a dataframe

In [2]:
df= pd.DataFrame({
    'Name':['Ali Raza','Ahmad Ali','Talha habib'],
    'Address':['Pakistan Lahore','Karachi Pakistan','Pakistan Islamabad']
})

In [3]:
df

          Name             Address
0     Ali Raza     Pakistan Lahore
1    Ahmad Ali    Karachi Pakistan
2  Talha habib  Pakistan Islamabad

this is how we can split the data of any column

In [4]:
df.Name.str.split(' ',expand=True)

       0      1
0    Ali   Raza
1  Ahmad    Ali
2  Talha  habib

appending new column names into the existing dataframe

In [6]:
df[['first_name','last_name']]= df['Name'].str.split(' ', expand=True)

In [7]:
df

          Name             Address first_name last_name
0     Ali Raza     Pakistan Lahore        Ali      Raza
1    Ahmad Ali    Karachi Pakistan      Ahmad       Ali
2  Talha habib  Pakistan Islamabad      Talha     habib

Adding the county & city

In [8]:
df[['country','city']]= df.Address.str.split(' ',expand=True)

In [9]:
df

          Name             Address first_name last_name   country       city
0     Ali Raza     Pakistan Lahore        Ali      Raza  Pakistan     Lahore
1    Ahmad Ali    Karachi Pakistan      Ahmad       Ali   Karachi   Pakistan
2  Talha habib  Pakistan Islamabad      Talha     habib  Pakistan  Islamabad

Now, we have filtered the data with a specific column names

In [10]:
df=df[['first_name','last_name','country','city']]

df

  first_name last_name   country       city
0        Ali      Raza  Pakistan     Lahore
1      Ahmad       Ali   Karachi   Pakistan
2      Talha     habib  Pakistan  Islamabad

type of Promp Engineer..